<template>
  <ul class="table__row table-title__list">
    <li class="table__col table-title__item"
        v-for="(item, index) of this[title]"
        :key="index"
    >
      {{item}}
    </li>
  </ul>
</template>

<script>
  export default {
    props: {
      title: {
        type: String,
      }
    },
    data() {
      return {
        user: [
          'Партнер',
          'Личный объем (PV)',
          'Групповой объем Перс (PV)',
          'Групповой объем (PV)',
          'Квал.',
          'Групповой гонорар',
          'Бонус наставника',
          'Чек'
        ],
        block_1: [
          'Партнер',
          'Личный объем (PV)',
          'Групповой объем Блок 1',
          'Групповой объем Перс (PV)',
          'Групповой объем (PV)',
          '%',
          'Квал.',
          'Структурный гонорар',
        ],
        block_2: [
          'Партнер',
          'Личный объем (PV)',
          'Групповой объем Перс (PV)',
          'Групповой объем (PV)',
          '%',
          'Квал.',
          'Структурный гонорар',
        ],
        block_3: [
          'Партнер',
          'Групповой объем 3-й блок (PV)',
          '%',
          'Квал.',
          'Структурный гонорар'
        ],
        bonus: [
          'Партнер',
          'Структурный гонорар'
        ]
      }
    },
  }
</script>

<style lang="scss">


</style>